
tap 'homebrew/cask-fonts'

# This must be installed before maven
brew 'openjdk'

brew 'act'
brew 'bash-completion'
brew 'coreutils'
brew 'doxygen'
brew 'entr'
brew 'fzf'
brew 'gnu-tar'
brew 'git'
brew 'git-lfs'
brew 'gnu-getopt'
brew 'maven'
brew 'pyenv'
brew 'python3'
brew 'rbenv'
brew 'reattach-to-user-namespace'
brew 'ruby'
brew 'the_silver_searcher'
brew 'tmux'
brew 'z'

brew 'svn' # For font-ubuntu

cask 'alacritty'
cask 'docker' unless Dir.exists?('/Applications/Docker.app')
cask 'font-ubuntu-mono'
cask 'google-chrome' unless Dir.exists?('/Applications/Google Chrome.app')
cask 'kindle'
cask 'macvim'
cask 'skype'

