
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'universal-ctags/universal-ctags'

# This must be installed before maven
cask 'java'

brew 'bash-completion'
brew 'coreutils'
brew 'doxygen'
brew 'entr'
brew 'fzf'
brew 'gnu-tar'
brew 'git'
brew 'git-lfs'
brew 'gnu-getopt'
brew 'maven'
brew 'mysql'
brew 'pyenv'
brew 'python2'
brew 'rbenv'
brew 'reattach-to-user-namespace'
brew 'ruby'
brew 'the_silver_searcher'
brew 'tmux'
brew 'universal-ctags/universal-ctags/universal-ctags', args: ['HEAD']
brew 'z'

cask 'alacritty'
cask 'docker' unless Dir.exists?('/Applications/Docker.app')
cask 'font-ubuntu'
cask 'google-chrome' unless Dir.exists?('/Applications/Google Chrome.app')
cask 'kindle'
cask 'macvim'
cask 'skype'

