
tap 'caskroom/cask'
tap 'caskroom/fonts'

brew 'bash-completion'
brew 'doxygen'
brew 'gnu-tar'
brew 'git'
brew 'git-lfs'
brew 'maven'
brew 'mysql'
brew 'python2'
brew 'python3'
brew 'rbenv'
brew 'reattach-to-user-namespace'
brew 'ruby'
brew 'the_silver_searcher'
brew 'tmux'
brew 'vim'

cask 'dbvisualizer'
cask 'docker'
cask 'font-ubuntu'
cask 'google-chrome'
cask 'iterm2'
cask 'java'
cask 'kindle'
cask 'macvim'
cask 'skype'
cask 'spectacle'
cask 'steam'
cask 'wineskin-winery'

